const folderNames = [
    ['6890來億-KY', '6568宏觀', '3005神基', '6757台灣虎航', '4933友輝', '2441超豐'],
    ['3034聯詠', '6890來億-KY', '3081聯亞', '4772台特化', '2645長榮航太', '6206飛捷', '4987科誠'],
    ['3563牧德','3044健鼎','3596智易','3147大綜','2480敦陽科','8436大江','3213茂訊','2412中華電','3045台灣大','1215卜蜂','4904遠傳','1216統一','4105東洋','6180橘子','6257矽格','2006東和鋼鐵','2387精元','6201亞弘電','6292迅德'],
    ['5314世紀','3563牧德','6469大樹','2753八方雲集','9921巨大','5439高技','8436大江','2439美律','6278台表科','2850新產','2421建準','2451創見','6877鏵友益','2211長榮鋼','3260威剛','3026禾伸堂','4931新盛力','1799易威','6658聯策','3528安馳','2535達欣工',],
    ['3034聯詠','3596智易','2474可成','6799來頡','4904遠傳','6203海韻電','6186新潤','2468華經'],
    ['6199天品', '6753龍德造船', '7402邑錡', '4904遠傳', '1784訊聯'],
    ['3264欣銓', '6228全譜', '2038海光'],
    ['3596智易', '3147大綜'],
    ['5274信驊','6781AES-KY','6584南俊國際','6903巨漢','2486一詮','4162智擎','8938明安','8043蜜望實'],
    ['6510精測','6442光聖','2345智邦','6944兆聯實業','6691洋基工程','3491昇達科','3081聯亞','6139亞翔','3363上詮','1560中砂','3680家登','7717萊德光電-KY','4971IET-KY','6667信紘科','4768晶呈科技','6788華景電','2467志聖','3551世禾','6903巨漢','6727亞泰金屬','3105穩懋','4991環宇-KY','8021尖點','5432新門','6753龍德造船','3152璟德','3010華立','4764雙鍵','6426統新','1784訊聯','3555博士旺','8390金益鼎','2313華通','5534長虹','3691碩禾','4542科嶠','6967汎瑋材料','3530晶相光','8431匯鑽科','3025星通','5522遠雄'],
    ['2404漢唐','6739竹陞科技','5536聖暉*','6139亞翔','8499鼎炫-KY','6121新普','6664群翊','7711永擎','4971IET-KY','6667信紘科','6788華景電','2467志聖','3376新日興','3551世禾','6291沛亨','6903巨漢','4931新盛力','3105穩懋','6451訊芯-KY','8021尖點','3265台星科','3090日電貿','8039台虹','4764雙鍵','6426統新','2441超豐','5309系統電','4542科嶠','6261久元','2388威盛','2466冠西電','3219倚強科','4577達航科技']
]

const output = document.getElementById('output');
                    output.innerHTML  += '<br>'
                    for(var t = 0; t < folderNames[d].length; t++) {
                        output.innerHTML += '<option value=#pic_'+t+'_>'+ folderNames[d][t] +'</option>'
                        }